[
{"title":"I Was a Boy","actors":"Linda Kash, Terra Vnesa, Hannah Endicott-Douglas, Stuart Hughes","director":"Grant Boyle, Joel Goldberg","synopsis":"Grant means Great. at 18, Grant has yet to find the greatness in his life. His parents marriage is eroding before his eyes. His mother (Linda Kash), unable to cope with the recent passing of her mother, tries to numb the pain. His father, (Stuart Hughes) struggling to make ends meet desperately tries to hold the family together. Left feeling like he's on the outside looking in at his own family; Grant needs to make the decision to be the man in the family or the 18 year old that still can't quite figure out how to say hello to the pretty girl.","genres":"Drama","year":"2012","imdbId":"tt2262481"},
{"title":"Hunger","actors":"Craig Horner, Bridget Regan, Bruce Spence, Tabrett Bethell","director":"Michael Hurst","synopsis":"Cara meets with Darken Rahl in an unpleasant way and is forced to conceal a dark secret from her friends that could hasten the end of her journey with them. Zedd's brother Thaddicus suddenly reappears, in the latest scam shop of the mapmaker we love to hate, and they may have a solution for her.","genres":"Action, Adventure, Drama","year":"2010","imdbId":"tt1562516"},
{"title":"Dutiful But Dumb","actors":"Curly Howard, Larry Fine, Moe Howard","director":"Del Lord","synopsis":"The stooges are photographers for Whack magazine (\"If it's a good picture it's out of Whack\") who, after messing up an assignment, are sent to the country of Vulgaria to get a picture of a death ray gun. In Vulgaria the penalty for taking pictures in is death, and the boys soon wind up in front of a firing squad. Curly's last request is a giant cigar and by the time he's done smoking it all the soldiers are asleep and the stooges make their escape.","genres":"Comedy, Short","year":"1941","imdbId":"tt0033565"},
{"title":"Boy Meets Joy","actors":"Pinky Tomlin, Joy Hodges, Mary Ruth, Lucille Page","director":"Ralph Staub","synopsis":"An assortment of musical acts parade before the camera; Joy Hodges and Pinky Tomlin sing; The Elderblooms, a group of ladies ranging in age from 63 to 76, sing a song; acrobatic dancer Lucille Page does a turn; and young Mary Ruth winds it up playing a classical piece on the piano. Disjointed is the word.","genres":"Musical, Short","year":"1939","imdbId":"tt0031116"},
{"title":"Slappy's Sliding Scale","actors":"Louise Rozett, Eric Slater","director":"Michael Rozett","synopsis":"Slappy and Sparky, two clowns in the Big Boss's propaganda machine, come to blows over their loyalty to the system-and each other-when Slappy decides he's done twisting balloons and juggling for a \"fascist lunatic.\" Slappy is tired of clowning to distract the crowd from the Boss's disturbing ideas, but Sparky loves their righteous boss, and takes it upon herself to correct Slappy with a plastic bat whenever he engages in Boss bashing or any other \"sin.\" Slappy quickly gets sick of being whacked, and the war begins. When Sparky finally confesses that she doesn't understand how people are supposed to behave, Slappy explains his theory about morality existing on a sliding scale. A momentarily confused Sparky figures out that Slappy's theory is all lies, and she takes matters into her own hands-with a bright, shiny aluminum bat. Slappy's Sliding Scale asks how people are supposed to behave morally when their leaders have no morality.","genres":"Short","year":"2009","imdbId":"tt1337539"},
{"title":"Cowgirl Sushi","actors":"Fuji Dreskin, Samuel Matao Dreskin","director":"June K. Inuzuka","synopsis":"An Asian American cowgirl rides the plains of Wyoming on her giant sushi searching for a long, lost ancestor.","genres":"Animation, Short, Comedy","year":"2012","imdbId":"tt2786110"},
{"title":"(After) She Left","actors":"Rachel Balaban","director":"Sarah Friedland","synopsis":"An 'empty nest' mother navigates the gaps in her experience of her home after her daughter has left for college.","genres":"Short, Drama, Family","year":"2014","imdbId":"tt3579144"},
{"title":"Waiting for the Light","actors":"Louis Guzzo, Colin Baumgartner, Teri Garr, Hillary Wolf","director":"Christopher Monger","synopsis":"A former vaudevillian magician (MacLaine) moves her straight-laced niece (Garr) and her two mischievous children to a small town. When the two kids get in trouble with a neighbor for stealing vegetables from his garden, the aunt concocts an illusion of ghosts in revenge. Only trouble is the whole town believes it is real and soon the press is swarming the town and a major magic trick is required for everyone to save face.","genres":"Comedy","year":"1990","imdbId":"tt0100899"},
{"title":"Circuit Breaker","actors":"Mathew Cunningham, Tom Valentine Gelo, Michael Heard Johnson, Harneet Kaur","director":"Mathew Cunningham, Whitney Bennett","synopsis":"Tobias, a hard working robot, finds himself at odds with government thugs as he tries to woo his coworker through increasing acts of daredevil recklessness.","genres":"Animation, Short, Fantasy","year":"2010","imdbId":"tt1850347"},
{"title":"Age Is Just a Word","actors":"Fevzi Akbay, Kitti Askew, Maneck Bhujwala, Richard B. Boddie","director":"Victoria Lea Rudd","synopsis":"Seventy people over the age of 65 are asked some of life's most pertinent questions. Does age really matter or is it all a state of mind?","genres":"Comedy","year":"2011","imdbId":"tt1606351"},
{"title":"Unfinished Business","actors":"James Brolin, Connie Sellecca, Nathan Cook, Michael Spound","director":"James L. Conway","synopsis":"Peter's ex wife shows up, looking for a job. Peter gets her an interview but she is told the results of her physical, that she has a terminal disease and doesn't know how to handle it. And one of the hotel's employees, has managed to keep his illiteracy a secret but when he's offered a promotion and his estranged son comes and asks for his help; causes problems for him in every front.","genres":"Drama, Romance","year":"1987","imdbId":"tt0605792"},
{"title":"Day in the Life of Doe","actors":"David Ghilardi, Sharon Jordan, Chris Moss, Maya Tremblay","director":"Sean William Adair","synopsis":"Doe is the silent everyman who along with his wisecracking friend (Chris Moss) and a Mysterious Woman (Sharon Jordan) battle a pair of powerful demons (Vic D.Vine and David Ghilardi) in order to get their souls back, save the beautiful actress (Maya Tremblay) Doe has fallen in love with and save the world.","genres":"Horror","year":"2011","imdbId":"tt2136860"},
{"title":"Two Years","actors":"Harriet Weaver, Odette Warder, Kate White, Anthony Pichette","director":"Teodora Cristea","synopsis":"One of many of NYC's aspiring actresses who has big dreams and does nothing to achieve them receives a rude awakening.","genres":"Short","year":"2014","imdbId":"tt3245542"},
{"title":"Lucky Terror","actors":"Hoot Gibson, Charles Hill, Lona Andre, George Chesebro","director":"Alan James","synopsis":"Lucky Carson is riding through the snow-covered mountains when he sees Bat Moulton and his gang chasing Jim Thornton. Since it's none of his business Lucky hides behind a boulder to avoid being involved. (Unlike most B-western heroes, those played by Hoot Gibson often not only avoided trouble that wasn't theirs, they often avoided trouble when it was directed at them.) But Thornton has doubled back and pulls a gun on Lucky with the intent of stealing Lucky's untired horse. But the frightened horse rears,dashes over a cliff and takes Thornton with him. Lucky goes through Thornton's saddle bags, finds gold in them and realizes why Moulton's men were chasing the late departed Thornton. Hiding the bags at the foot of a mountain, Lucky (on Thornton's now-rested horse) rides on and comes across a Medicine Show ran by Doc Haliday. He hooks on as a sharpshooter and meets entertainer Ann Thornton, the dead man's niece. Moulton and his men ride up and inform Ann that they have taken possession of the Bonanza Mine that was owned jointly by Ann and her late uncle. Moulton also suspects Lucky of having the gold since he has found Thornton's body but no gold. Moulton goes to Sheriff Hodges and charges Lucky with the murder and robbery of Thornton. Lucky gets thrown in a cell with a drunk named Wheeler, who is the only lawyer in town and is assigned by the court to be Lucky's defender. During the trial, while Wheeler is sleeping off his hangover, Lucky manages to implicate Moulton and his men revealing that he saw them chasing Thornton. Wheeler wakes up and believing Lucky to be guilty --- Wheeler has never had an innocent client---takes Lucky to a back room during a recess and gives him the best and only advice gained in his years of lawyering... RUN. Lucky does. Meanwhile, the coroner breaks down Moulton's testimony, and the jury finds that Thornton's death was accidental. The Judge orders Moulton and his men to cease and desist with their activities at the Bonanza Mine, and goes to tell Lucky he has been cleared. He acts somewhat surprised to find that Lucky has departed the scene, although he shouldn't have been considering he left Wheeler and his client alone in a room with a window. (Any B-western that has a court with Milburn Morante as the judge, Charles King as a defense lawyer, Horace B. Carpenter as the prosecutor and buzzard-looking Nelson McDowell as the Coroner has to be cherished. ) Meanwhile, Moulton's gang is chasing Lucky, and Ann and the Sheriff go to the mine and find Jim Thornton's diary that reveals that Moulton had held Moulton prisoner after the gold had been discovered and extracted---but did allow Thornton to keep his diary entries up to date---and they conclude that ol' Uncle Jim had managed to escape and take the gold with him. The sheriff takes off after Moulton and sees Lucky. But Lucky also sees the sheriff and thinks he is the chasee since he didn't wait around to hear the jury's verdict. Lucky takes off and manages to get himself captured by Moulton and company and they truss him up in an ore car with intentions of giving him a ride over the cliff if he doesn't fess up about where the gold is hidden. It all works out.","genres":"Western","year":"1936","imdbId":"tt0027917"},
{"title":"The Giver","actors":"Jeff Bridges, Meryl Streep, Brenton Thwaites, Alexander Skarsgård","director":"Phillip Noyce","synopsis":"This film, based on Lois Lowry's book, tells the story of a perfect world. Everyone here is happy. When Jonas is 18 years old, he's chosen to be the community's Receiver of Memories. He enters into training with an old man called The Giver. From the Giver, Jonas learns about pain, sadness, war, and all the unhappy truths of the \"real\" world. He quickly realizes that his community is fake. Confronted with this reality, Jonas faces difficult choices about his own life and his future.","genres":"Drama, Sci-Fi","year":"2014","imdbId":"tt0435651"},
{"title":"Let's Switch!","actors":"Barbara Eden, Barbara Feldon, George Furth, Richard Schaal","director":"Alan Rafkin","synopsis":"Chaos ensues when two former college friends, one a housewife and the other the editor of a hip woman's magazine, decide to switch lifestyles between the two of them.","genres":"Comedy","year":"1975","imdbId":"tt0073283"},
{"title":"Gloria","actors":"Julie Carmen, Tony Knesich, Gregory Cleghorne, Buck Henry","director":"John Cassavetes","synopsis":"Mild mannered Jack Dawn has been secretly working as an accountant for the mob. He, his Puerto Rican wife Jeri, his teen-aged daughter Joan and his mother-in-law, all who were planning on going on the run, are murdered by the mob because Jack was going to inform on them to the FBI. Before they're killed, Jack and Jeri are able to send their six-year old son Phil to Jeri's friend and their neighbor, Gloria Swenson, for safe keeping. Also with Phil is the book which contains all the information Jack was going to turn over. Gloria and Phil have an antagonistic relationship, not so much for who they are but what they are, Phil a kid, and Gloria a strange white woman who hates kids. As an ex-mistress of a mobster, Gloria learns that the people that killed the Dawns are old friends of hers. As Gloria and Phil go on the run both from the mob and from the authorities (who believe she kidnapped Phil) throughout New York City, Gloria has to come up with a plan on how best to save themselves, which is not easy because of their love\/hate relationship and the fact that precocious Phil has a mind of his own. That plan includes what to do with the book, but more importantly how to save Phil as the mob would still be after him regardless of the book just in case he knows something about his father's dealings. All through their ordeal, Gloria is not averse to shooting to kill, especially if those who she is trying to kill are trying to kill her and Phil first.","genres":"Crime, Drama, Thriller","year":"1980","imdbId":"tt0080798"},
{"title":"I Yam What I Yam","actors":"William Costello, Charles Lawrence, William Pennell, Bonnie Poe","director":"Dave Fleischer, Seymour Kneitel","synopsis":"Popeye, Olive (rowing), and Wimpy (eating) arrive in America by rowboat. Popeye builds a log cabin (by punching some trees) and sets off to gather some ducks. He fights a few indians along the way, but they pose no real threat. But meanwhile, back at the cabin, the indians have been sneaking up and have Olive and Wimpy under siege. Wimpy soon runs away, and runs into Popeye and the ducks he has collected, while Olive has been single-handedly fighting off an endless stream of indians. Popeye eats his spinach and makes short work of the remainder of the tribe, turning the leader into 'Mahatma Gandhi'.","genres":"Family, Animation, Short","year":"1933","imdbId":"tt0024162"},
{"title":"The Last Leaf","actors":"Hermione Baddeley, Pat Billingsley, Art Carney, Jane Kaczmarek","director":"David Anspaugh","synopsis":"An Easter Parable: As lingering pneumonia takes her will to live, a young girl decides that she will die when the last leaf drops from a dying vine outside her window. Her neighbor, an elderly artist frustrated by his inability to paint what is in his heart, follows the example of the Savior and makes the ultimate sacrifice to save her life. In doing so, he creates the masterpiece he has been struggling to paint.","genres":"Drama, Short","year":"1983","imdbId":"tt0448227"},
{"title":"Lock Up","actors":"Sylvester Stallone, Donald Sutherland, John Amos, Sonny Landham","director":"John Flynn","synopsis":"Frank Leone is nearing the end of his prison term for a relatively minor crime. Just before he is paroled, however, Warden Drumgoole takes charge. Drumgoole was assigned to a hell-hole prison after his administration was publicly humiliated by Leone, and has now arrived on the scene to ensure that Leone never sees the light of day.","genres":"Action, Crime, Drama","year":"1989","imdbId":"tt0097770"},
{"title":"This Light Rains","actors":"Cort Garretson, Jennifer Faulkner, Matthew Laslo-White, Terry Beedle","director":"Aaron Rabin","synopsis":"On the morning a soldier leaves for war, he must bring his family together or risk losing them forever.","genres":"Short, Drama, War","year":"2007","imdbId":"tt1419101"},
{"title":"Summer School","actors":"Mark Harmon, Kirstie Alley, Robin Thomas Grossman, Patrick Labyorteaux","director":"Carl Reiner","synopsis":"A high-school gym teacher has big plans for the summer, but is forced to cancel them to teach a \"bonehead\" English class for misfit goof-off students. Fortunately, his unconventional brand of teaching fun field trips begins to connect with them, and even inspires ardor in some.","genres":"Comedy, Romance","year":"1987","imdbId":"tt0094072"},
{"title":"Trixie","actors":"Emily Watson, Dermot Mulroney, Nick Nolte, Nathan Lane","director":"Alan Rudolph","synopsis":"Emily Watson stars as Trixie, an eccentric woman who aspires to quit her job as a security guard and become a private detective. However, comedy intervenes and the mess begins...","genres":"Comedy, Crime, Mystery","year":"2000","imdbId":"tt0162711"},
{"title":"Mis Boon: Daughters of the Horn","actors":"Sewit Bereket","director":"Feyrouz Abdulrahman","synopsis":"A group of young Eritrean women living in Canada gather over the traditional coffee making setting to discuss their recollections and unique experiences through war. Nearly 20 years after the declaration of independence for this nation, the implications for a growing number within the Diaspora are explained first-hand through very personal and relatable collective voices. Through these engaging stories, this 23-minute documentary will provide a brief look at the history of Eritrea and some of the many sacrifices incurred by its people.","genres":"Documentary, Short, Family","year":"2008","imdbId":"tt2051932"},
{"title":"Swinging in the Rain","actors":"Brittany Andrews, Nikki Sinn, Alex Dane, Morgan Fairlane","director":"Cash Markman","synopsis":"It is 1926. The Horny Bothers have just released the first adult \"talkie\" entitled \"The Jazz Swinger.\" Now, in order to compete, Paramounds Dirty Pictures has sent a mandate down to their top director, Cecil B. DeBalls. His next sexual extravaganza must be all-singing, all-dancing, all-screwing! It will star the studio's hottest sex team, Gina LaMont and Don Lockwood. It can't miss! Or can it? No one at the studio knows how to make a \"talkie.\" And, worse, Gina may be good to look at, but she has a voice that is better suited for hailing cabs in New York city!","genres":"Adult, Comedy, Musical","year":"1997","imdbId":"tt0240951"},
{"title":"Reel Competition","actors":"Rob Earnshaw, John Jensen, Mike McCalmet, Paxton Williams","director":"Michael Reinhart","synopsis":"After 14 years with Captain Cinema Mick Philmore, is demoted and replaced by Marty, who he trained 4 years ago. So Mick, takes his assistant, and his girlfriend (a booker for Captain Cinema) and opens the old Twin Bill down the street. Now the fun begins as Mick and his staff try to stay afloat with one bad idea after another.","genres":"Comedy","year":"2003","imdbId":"tt1538978"},
{"title":"I, Robot","actors":"Will Smith, Bridget Moynahan, Alan Tudyk, James Cromwell","director":"Alex Proyas","synopsis":"Set in a future Earth (2035 A.D.) where robots are common assistants and workers for their human owners, this is the story of \"robotophobic\" Chicago Police Detective Del Spooner's investigation into the murder of Dr. Alfred Lanning, who works at U.S. Robotics, in which a robot, Sonny , appears to be implicated, even though that would mean the robot had violated the Three Laws of Robotics, which is apparently impossible. It seems impossible because.. if robots can break those laws, there's nothing to stop them from taking over the world, as humans have grown to become completely dependent upon their robots. Or maybe... they already have? Aiding Spooner in his investigation is a psychologist, Dr. Susan Calvin, who specializes in the psyches of robots.","genres":"Action, Mystery, Sci-Fi","year":"2004","imdbId":"tt0343818"},
{"title":"Nobody Lives Forever","actors":"John Garfield, Geraldine Fitzgerald, Walter Brennan, Faye Emerson","director":"Jean Negulesco","synopsis":"Ex-GI Nick Blake gets involved in a scheme to fleece a rich young widow, but finds himself falling for her for real, much to the displeasure of his racketeer cohorts.","genres":"Crime, Drama, Film-Noir","year":"1946","imdbId":"tt0038780"},
{"title":"The Woman in White","actors":"Tara Fitzgerald, Justine Waddell, Andrew Lincoln, Susan Vidler","director":"Tim Fywell","synopsis":"Based upon Wilkie Collins Victorian mystery, the gothic tale tells of a pair of half sisters whose lives end up caught in a grand conspiracy revolving around a mentally ill woman dressed in white. As the story unfolds, murder, love, marriage, and greed stand between the two women and happy lives. Their only hope is the secret the woman in white waits to tell them.","genres":"Mystery, Thriller","year":"1997","imdbId":"tt0137279"},
{"title":"Sara Jane","actors":"Angelique Chase, Robert Forrest, Wynn Ambos","director":"Chip Lane","synopsis":"A turn-of-the-century widow must fight off the temptations of a stranger while trying to save her dying son.","genres":"Short, Drama, Family","year":"2013","imdbId":"tt3102314"},
{"title":"Winter Fugue","actors":"Yelena Khvatskaya, Patrick Porter","director":"Jadrien Steele","synopsis":"In a rundown house in Brooklyn, a daughter discovers the hidden beauty in the troubled father she barely knew.","genres":"Short, Drama","year":"2010","imdbId":"tt1472546"},
{"title":"Life's Burning Desire","actors":"The Australian Choreographic Ensemble, Paul Mercurio","director":"Stephen Cummins","synopsis":"Follows Paul Mercurio and his dance company, the Australian Choreographic Ensemble, in the creation of their dance piece \"Contact\".","genres":"Documentary","year":"1992","imdbId":"tt0482057"},
{"title":"The Last Templar","actors":"Rusty Locke, Bryan Ludens, Alex Reisfield","director":"Daniel Madore","synopsis":"Captured a lone Knight Templar must free himself from captivity and reclaim his lone possession, the Holy Grail.","genres":"Short, Action, Adventure","year":"2013","imdbId":"tt3148486"},
{"title":"The Amistad Revolt: All We Want Is Make Us Free","actors":"Elijah Alexander, Sedly Bloomfield, Vinie Burrows, Max Chalawsky","director":"Karyl K. Evans","synopsis":"The Amistad Revolt: \"All We Want Is Make Us Free\" is a compelling, dramatic story of the most significant event against slavery prior to the Civil War. 53 Africans, captured in what is now Sierra Leone, took over the schooner La Amistad in Cuban waters. Thwarted in their plans to return home, they found themselves jailed in New Haven, Connecticut, facing charges of murder and piracy. The video portrays the campaign that sparked the Abolitionist movement, raised the consciousness of the country to the evils of slavery, and emerged victorious after the former President John Quincy Adams argued the case before the U.S. Supreme Court","genres":"Documentary, Short","year":"1995","imdbId":"tt0453449"},
{"title":"The Bat, the Cat, and the Penguin","actors":"Robert Urich, Michael Keaton, Tim Burton, Michelle Pfeiffer","director":"Michael Meadows, John Pattyson","synopsis":"An overview of the making of Batman Returns (1992).","genres":"Documentary","year":"1992","imdbId":"tt0486272"},
{"title":"Fundraising","actors":"Farrah Crane, Alex Geissbuhler, Sean Murray, Anton Rayn","director":"Sean Murray","synopsis":"Adam takes a deal that goes sour. Now he has to procure funds from non-traditional sources.","genres":"Short, Mystery","year":"2008","imdbId":"tt2024411"},
{"title":"Old West","actors":"Aaron Ashmore, Azar Beaudoin, Azariah Beaudoin, Greg Collins","director":"Jon Knautz","synopsis":"There's no escaping your sins.","genres":"Short, Drama, Western","year":"2010","imdbId":"tt1754307"},
{"title":"Initial Conditions","actors":"Michael Anderson, Ariana Bagnato, Craig Glantz","director":"Dominick Bagnato","synopsis":"Tom Cavanaugh, an obsessive research meteorologist, is on a quest to ensure the safety of his daughter. Through manipulation of chaos theory, he comes to believe that he is on the verge of forecasting the future through science. Brian, his older, academic brother, must convince Tom that this is a scientific impossibility while staying conscious of Tom's delicate mindset. The film explores the idea that everything that we do, everything that occurs, has an effect on other aspects of our world.","genres":"Short","year":"2007","imdbId":"tt1367220"},
{"title":"Anatomy of a Crime","actors":"Darren McGavin, Ted Knight, Simon Scott, Read Morgan","director":"John Peyser","synopsis":"Two episodes of the TV series \"The Outsider\" (There Was a Little Girl & Tell It Like It Is... and You're Dead) edited together to create a TV movie. Private detective David Ross has two apparently unconnected cases to investigate in the same day. In the first he is hired by a millionaire who paid a large ransom for his kidnapped daughter twelve years before, but she was never seen again. Now a woman has come forward who claims the young girl she raised is the millionaire's missing daughter. Later, Ross is contacted by a retired burlesque dancer who's about to publish her memoirs and possibly reveal the secrets of some important people, but someone is determined to stop her.","genres":"Crime, Drama","year":"1969","imdbId":"tt0064025"},
{"title":"Cavalcade of the West","actors":"Hoot Gibson, Rex Lease, Marion Shilling, Adam Goodman","director":"Harry L. Fraser","synopsis":"During the gold rush days a wagon train is attacked by a gang of renegades. John Knox is killed and one of his young sons, Asa Knox, is kidnapped by the renegade leader. The other son, Clint, and his mother Martha escape and reach St. Joseph, Missouri. Clint grows up and becomes a crack rider for the Pony Express. The kidnapped brother, now known as Ace Carter, has been raised by the outlaws with a contempt for the law. He is an unsuccessful rival of Clint's for the Pony Express job, which fosters enmity between them. Ace holds up a stagecoach on which Martha Knox and Clint's sweetheart, Mary West, are passengers. Clint takes the trail and runs him down. Clint later learns Ace's true identity and saves him from a lynch mob. Because of the circumstances, Ace's captors relent, and the two brothers and their mother are reunited.","genres":"Action, Drama, History","year":"1936","imdbId":"tt0027434"},
{"title":"Squeal","actors":"Allison Batty, Kevin Oestenstad, Stephen Dean, Joe Burke","director":"Tony Swansey","synopsis":"When band members are stranded on a country road, excitement of their first tour is diminished by the horrors of a science experiment gone awry. Their pig-human hybrid mutant captors have many horrors in store but true revulsion does not descend until daylight when the extent of their work is revealed.","genres":"Horror","year":"2008","imdbId":"tt1288399"},
{"title":"Kathleen","actors":"Shirley Temple, Herbert Marshall, Laraine Day, Gail Patrick","director":"Harold S. Bucquet","synopsis":"Kathleen is a 12 year old who lives in a big house with a nanny, a butler, maids, no mother and a father who is working most of the time. She dreams of a family with a mother, father and her, and tells everyone that she has such a family. Because of this story, she cannot invite any friends over as they will see that it is not true. Kathleen and her nanny, Mrs. Farrell do not get along, so her father hires a psychologist name Dr. Kent to be her new nanny for the summer. Her father has a new girlfriend, named Lorraine, who he is considering for his wife and mother to Kathleen. Kathleen does not like her and Lorraine is cold to Kathleen. Kathleen envisions Dr. Kent as the perfect mother for her and wife for her father.","genres":"Drama, Romance, Comedy","year":"1941","imdbId":"tt0033780"},
{"title":"Signing Time! Volume 1: My First Signs","actors":"Alex Brown, Leah Coleman, Rachel Coleman","director":"Emilie de Azevedo Brown","synopsis":"From their magical animated treehouse, Rachel, Alex, Leah, and all their friends share 18 American Sign Language (ASL) signs with your child in a fun and playful way.","genres":"Short, Family","year":"2002","imdbId":"tt0476376"},
{"title":"A Certain Darkness","actors":"Isabella Arnaboldi, Christopher Arnone, Joseph Arnone, Lyman Chen","director":"Wes Tarca","synopsis":"Guilt tears through the consciousness of Julian Shay a man who cannot forget the damage he has done. And he is not alone for there are others who will stop at nothing to make sure he doesn't forget and that he is never forgiven.","genres":"Thriller","year":"2008","imdbId":"tt1326747"},
{"title":"The 50 Greatest Documentaries","actors":"Zoë Wanamaker, David Aaronovitch, Barry Ackroyd, Randall Adams","director":"Garry John Hughes, Elaine Shepherd","synopsis":"A countdown of the top 50 documentaries, based on a vote by documentary filmmakers.","genres":"Documentary","year":"2005","imdbId":"tt0490551"},
{"title":"Cody of the Pony Express","actors":"Jock Mahoney, Dickie Moore, Peggy Stewart, William Fawcett","director":"Spencer Gordon Bennet","synopsis":"An Eastern syndicate, plotting to gain control of the western frontier, hires a gang led by Mort Black to drive out the settlers. Army undercover agent Lt. Jim Archer and young Pony Express rider Bill Cody join forces to combat the wide-spread outlaw attacks by Black and his gang.","genres":"Western","year":"1950","imdbId":"tt0042335"},
{"title":"Anywhere, Anytime","actors":"Airlie Walsh, Ross Treleaven","director":"Luke Loseby, Dimity Clancey","synopsis":"What happens when a journalist and a firefighter join forces to make a short film? The answer: Anywhere. Anytime. Anywhere. Anytime. is a tongue in cheek, science fiction drama which takes a spaceman on a mission to the planet Celaris One. But to do what? What is the important mission GP base has sent him on? Get ready for a futuristic journey, full of high tech whizzbangery, that culminates with a satirical twist. Enjoy.","genres":"Short, Sci-Fi","year":"2013","imdbId":"tt3385732"},
{"title":"The Last Mogul","actors":"Irving Azoff, Lucille Ball, Peter Bart, Norman Brokaw","director":"Barry Avrich","synopsis":"A biography of powerful Hollywood agent and executive Lew Wasserman.","genres":"Documentary, Biography","year":"2005","imdbId":"tt0388201"},
{"title":"Frog","actors":"Audrey Aroha Tietz, Matthew Corbett, Jessica Gamble","director":"Philip Hardy","synopsis":"Four friends find an injured frog. Do they try and save it? Or put it out its misery?","genres":"Animation, Short, Comedy","year":"2013","imdbId":"tt3432942"},
{"title":"Once Upon a Savage Night","actors":"Michal Slaby, Michael Gentile, Ryan Jonze, Mac Cappuccino","director":"David Gutnik","synopsis":"A struggling ballet dancer and a small-time gangster reunite in South Brooklyn, New York.","genres":"Short, Action, Crime","year":"2012","imdbId":"tt1520418"},
{"title":"The Trick","actors":"Sarah J. Chan, Lauren Fair, Alaithia Velez, Scott Venters","director":"William James Chan","synopsis":"Johnny, a young magician, uses his skills and the help of a con artist, Patrick, to hustle unsuspecting card players. However, things get complicated one night when Johnny's trick fails and Patrick loses all his money. Now Johnny must use all his knowledge to get the money back...or else!","genres":"Short, Comedy","year":"2007","imdbId":"tt1454695"},
{"title":"The Final Judgment","actors":"E.H. Calvert, Dorothy Phillips, William Bailey, Juanita Delmorez","director":"Archer MacMackin","synopsis":"The story opens in the Klondike. Two young men from the East are in love with Edna Wallace. She accepts Brandon. A few years go by and we see McCormack, the friend and rejected suitor, attempting to rescue Brandon from drink and ruin. They quarrel and McCormack is wounded in a pistol fight. Brandon escapes to New York with his child. His wife follows. The scene then shifts to the Metropolis. McCormack is now a newspaper editor. One morning he confronts Brandon robbing his apartment. The latter dies of heart failure from shock. He leaves behind a letter which enables McCormack to locate the missing son. In the role of a \"Cub\" reporter he covers a big fire and rescues his mother from the burning building. The reunion in the hospital later, with McCormack present, is as touching as it is beautiful.","genres":"Drama, Short","year":"1913","imdbId":"tt0401421"},
{"title":"Jim Gaffigan: Mr. Universe","actors":"Jim Gaffigan","director":"Jay Karas","synopsis":"Jim Gaffigan does it again with his new stand-up Mr. Universe. Gaffigan jumps from topic to topic joking around with a varied number of topics. Some of the topics included are McDonalds, family, Disney World, and much more.","genres":"Comedy","year":"2012","imdbId":"tt2273321"},
{"title":"Callie Wants a Solo","actors":"Robin Rose Singer, Lauren Ruff, Andrew T. Scully","director":"Erick Fix","synopsis":"Sick of crazy stage moms, a young theater teacher decides to get away for the weekend with her co-worker and ends up ruining her surprise engagement.","genres":"Short, Comedy","year":"2013","imdbId":"tt3391594"},
{"title":"Omid Djalili: Live in London","actors":"Omid Djalili","director":"Omid Djalili","synopsis":"Britain's best loved comedian, the multi award-winning British-Iranian, Omid Djalili takes on the world in a brand new sensational stand up show.","genres":"Comedy","year":"2009","imdbId":"tt1786611"},
{"title":"Into the Cold Darkness","actors":"Andre Wullaert","director":"Andre Wullaert","synopsis":"Documenting one mans journey into the world of the Paranormal, experiences, evidence captured and details of the latest equipment used to gather data.","genres":"Documentary","year":"2015","imdbId":"tt3817972"},
{"title":"Salvation Boulevard","actors":"Jennifer Connelly, Greg Kinnear, Pierce Brosnan, Ed Harris","director":"George Ratliff","synopsis":"Set in the world of mega-churches in which a former Deadhead-turned-born again-Christian finds himself on the run from fundamentalist members of his mega-church who will do anything to protect their larger-than-life pastor.","genres":"Action, Comedy, Drama","year":"2011","imdbId":"tt1251743"},
{"title":"Dancing with Shadows","actors":"Eli Hayes","director":"Eli Hayes","synopsis":"A nameless boy believes that he may have passed on from conscious existence. His world has become one where dreams are a figment of the soul, rather than the mind. Therefore, the afterlife that he experiences is a compilation of dreams stemming from his subconscious.","genres":"Short, Fantasy","year":"2012","imdbId":"tt2330805"},
{"title":"Waking Eyes","actors":"Natalio Banchero, Ariel Baty, Leah Chandler Mills, Aaron de Pry","director":"Sarah R. Lotfi","synopsis":"One woman's subconscious journey into fantasy brings her closer to her true self and the loved ones around her.","genres":"Short, Drama, Family","year":"2011","imdbId":"tt2007516"},
{"title":"Coffee-Static","actors":"Dominic Luongo","director":"Dominic Luongo","synopsis":"Late one night our sleeping protagonist awakens to a haunting melody coming from the radio he is sure he had turned off. In an effort to fully achieve consciousness and get a grasp on the situation, our protagonist approaches coffee of an indeterminable age and attempts to reheat it. What follows is a supernatural struggle for caffeine.","genres":"Short, Fantasy","year":"2007","imdbId":"tt1347131"},
{"title":"Boule de suif","actors":"Jay Tuck, Konstantin Metz, Irene Prieler, Ute Gassner","director":"Frank Gassner","synopsis":"The story is based on Guy de Maupassant's novella of the same name. The soundtrack is largely the same text. The film is a mixture of live action and animation filmed in various techniques. In many scenes images coalesce into tableaus. Each subject is given apparent levels of meaning, which in turn stand beside and on top of one another on equal footing. The meaninglessness of that which seems so certain such as gender or age is exposed with great relish. The individual threads run parallel, only touching occasionally but nevertheless influencing the overall image. Boule de suif is ultimately sold down the river. The visual language in its complexity is reminiscent of commercial television, particularly of infomercials with their continuous fade-ins and over-blendings. The shifts in meaning inevitably evoke contradictions that at times seem bizarre. Everything combines to form a fantastic panorama of shapes and colors that goes far beyond any narrative and in large parts venerates the pure form.","genres":"Animation, Drama, History","year":"2012","imdbId":"tt2380534"},
{"title":"The Private Afternoons of Pamela Mann","actors":"Barbara Bourbon, Sonny Landham, Darby Lloyd Rains, Marc Stevens","director":"Radley Metzger","synopsis":"A housewife is tracked by a private investigator hired by her wealthy husband.","genres":"Adult, Comedy","year":"1974","imdbId":"tt0072035"},
{"title":"El camino","actors":"Leo Fitzpatrick, Elisabeth Moss, Christopher Denham, Wes Studi","director":"Erik S. Weigel","synopsis":"Elliot, 31, a product of the Washington D.C. foster care system, has spent most of his life moving from place to place. When he is contacted by Matthew, a childhood friend from \"the system\" dying of cancer, Elliot goes to be by his side. At the funeral, he meets Gray and Lily, two friends of Matthew, both aimless in their present lives. Motivated by their sense of loss, and personal anger, Gray, Lily and Elliot steal Matthew's ashes and take them to Mexico. As the three travelers journey cross-country with Matthew's urn in tow, they are forced to confront their own sense of family, identity and future. Set against the changing American landscape, EL CAMINO follows these characters as they search for themselves in a country that has lost it's own identity. Gray, the wayward son of a prominent D.C. family, has left his pregnant girlfriend. He is angry, volatile and fearful of commitment. Lily is Matthew's ex-girlfriend. Unbeknownst to her parents, she has dropped out of college and become an exotic dancer. Lost in alcohol and pills she longs for her mother's approval. Elliot is outside the cultural mainstream. He carries a suitcase filled with documents and mementos of his life. An explorer of human experience, he interviews and videotapes people he meets. Haunted by dreams of his mother's drowning, Elliot struggles to find his place in the world. EL CAMINO is a humorous and compassionate film about friendship, family, and search for self in today's American landscape.","genres":"Drama","year":"2008","imdbId":"tt0884038"},
{"title":"Soul of Solomon","actors":"Chris Graham, Frankie Ramos","director":"Jayan Cherian","synopsis":"A radical re-reading of Biblical Song of Solomon on the milieu of the relationship between a Priest and a Sex worker.","genres":"Short, Drama","year":"2008","imdbId":"tt1381882"},
{"title":"The Magic Sledgehammer","actors":"Nathan Hill, Fabian Lapham, Michael Wannenmacher","director":"Stuart Van Eysden","synopsis":"Once upon a time there lived a Sledgehammer. But unlike most sledgehammers this one was not content with a life of hammering in fence posts. This one did not want to sit stagnant in a hardware store just waiting for destiny to come to it. This one was going to run toward destiny head on. And when the two collide, the world will be changed forever.","genres":"Short, Comedy","year":"2007","imdbId":"tt2345727"},
{"title":"Late Bloomers","actors":"Connie Nelson, Dee Hennigan, Gary Carter, Jonah Marsh","director":"Julia Dyer","synopsis":"The story of two ordinary women in their mid years, who live deep in the bible belt, populated by square teachers, libidinous students and home to suburban monotony. Carly is a married woman with two kids, who works as the school secretary; Dinah is the single, lonely math teacher who coaches the girls' basketball team. Long time disinterest between the women perchance evolves in to a series of one-on-one basketball games, during which the two women grow closer physically and emotionally, until one heated game ends spontaneously in a kiss. The outcry from family, friends and the community as the relationship between these two women blooms, creates a timely story in which is woven the notion of family, of gay relationships and which raises the banner of gay marriage.","genres":"Comedy, Drama, Romance","year":"1996","imdbId":"tt0116834"},
{"title":"Chiaroscuro, Baby","actors":"Christopher Bolla, Christianna White, Milan Alley, Matt Shuman","director":"Anthony Kilburn","synopsis":"An aspiring painter compromises his ambition for his seductive girlfriend, only to be torn when his empowering, new muse reignites his passion.","genres":"Drama","year":"2009","imdbId":"tt1379199"},
{"title":"Phil Ochs: There But for Fortune","actors":"Joan Baez, Jello Biafra, Billy Bragg, François De Menil","director":"Kenneth Bowser","synopsis":"From civil rights to the anti-war movement to the struggles of workers, folksinger Phil Ochs wrote topical songs that engaged his audiences in the issues of the 1960s and 70s. In this biographical documentary, veteran director Kenneth Bowser shows how Phil's music and his fascinating life story and eventual decline into depression and suicide were intertwined with the history-making events that defined a generation. Even as his contemporaries moved into folk-rock and pop music, Phil followed his own vision, challenging himself and his listeners. Not one to pull punches, Ochs never achieved the commercial success he desperately desired. But his music remains relevant, reaching new audiences in a generation that finds his themes all too familiar.","genres":"Documentary, Biography, History","year":"2010","imdbId":"tt1597089"},
{"title":"I Am Musical","actors":"Lindsey Curley, Mike McLaughlin, Emily Price, Paul Savory","director":"Chelsea Ryan","synopsis":"Liz Daniels has always wanted to sing and dance on stage. After arriving at her new school, Bobby Kennedy High, Liz soon realizes the road to her dream isn't the smoothest journey. She must contest with the experienced and bitter rival, Lauren Baker, who does not take kindly to new competition to her star status. Liz's drama teacher, Mr. Fountain, also isn't the most pleasing person at school either. After failing the audition for the fall musical, Liz tries to regather her confidence with the help of TJ, the school's most popular boy, who also happens to be Lauren's ex. The two experience a romantic bond on the schools rooftop after their first date. But when TJ takes things too far, Liz realizes his true intentions and ends the date early. TJ shows up later that week at Liz's work, however he is not alone, Lauren is grinning eagerly on his arm. Liz vows that she will take her revenge during the spring musical audition. Months pass and Liz is soon ready to take on her archenemy. Tensions rise and a dance battle quickly ensues between the two in an alternate reality. Will Liz earn her spotlight on the theatrical stage or find out she has an alternate destiny?","genres":"Short, Musical","year":"2010","imdbId":"tt1977818"},
{"title":"The Taking of Beverly Hills","actors":"Ken Wahl, Matt Frewer, Harley Jane Kozak, Robert Davi","director":"Sidney J. Furie","synopsis":"A chemical spill has caused the occupants of Beverly Hills to be forcibly evacuated. A retiring football player left behind, finds that the toxic gas emulating from the spill is a bogus front for a heist set up by fired police officers out to plunder the city of all its valuables. Finding himself siding with a corrupt cop who was once apart of the plan until he discovered the city's mayor had just been blown away, by one of the chief crooks in charge. Now both on the run with no help in sight...both must do whatever they can to stop these murderous looters.","genres":"Action, Thriller","year":"1991","imdbId":"tt0105526"},
{"title":"The Last Escape","actors":"Stuart Whitman, John Collin, Martin Jarvis, Pinkas Braun","director":"Walter Grauman","synopsis":"The end of WW2. Allied forces enter a well-guarded German rocket base and kidnap among others the rocket scientist Dr. Von Heinken. When they try to get away they are followed both by Germans and Russians who both want to get their hands on the doctor.","genres":"War, Drama","year":"1970","imdbId":"tt0065966"},
{"title":"Absence of the Good","actors":"Stephen Baldwin, Tyne Daly, Elizabeth Barondes, Brian Lee Bouck","director":"John Flynn","synopsis":"Salt Lake City homicide detective Caleb Barnes is under increasing pressure from all sides to crack a string of serial killings that have been terrorizing the city. At the same time, Barnes' home life is beginning to crumble in the wake of his son's accidental death. Will he solve the killings before the stress tears him apart?","genres":"Thriller","year":"1999","imdbId":"tt0198279"},
{"title":"Bro","actors":"Julie Andrews, Michael Davis, Ellie Paskell, Emma Swinn","director":"Chris Dundon","synopsis":"Simon's brother Mark suffers from Fragile X Syndrome. Simon believes his failure to lead a normal adolescent life is solely down to his brothers disability.","genres":"Short, Drama","year":"2010","imdbId":"tt1623639"},
{"title":"Bound Cargo","actors":"Rena Riffel, John Comer, David O'Kelly, Ryan James","director":"Lloyd A. Simandl","synopsis":"Three girls are on the run from a group of disbanded soldiers. Nowhere to go they come across a lonely widow to seek refuge. Risking her life to save the young women the widow only demands erotic pleasure in exchange.","genres":"Action, Drama, Horror","year":"2003","imdbId":"tt0374333"},
{"title":"Molly's Girl","actors":"Kristina Valada-Viars, Emily Schweitz, Ellen Dolan, Sondra Ward","director":"Scott R. Thompson","synopsis":"An emotional misfit named Molly believes she's found love in a drunken one-night stand with a gay-marriage lesbian activist named Mercedes. But once sober, Mercedes discovers she cannot escape the clingy and desperate Molly. As she's about to call upon all of her legal options to rid herself of Molly, Mercedes learns that Molly's father is actually an influential state senator opposed to gay marriage. Seeing this as a golden opportunity, Mercedes convinces Molly to pretend that they are an engaged lesbian couple, though Molly's not at all gay, as a way to drive a stake into the senator's politics. But as Mercedes gets to know Molly's family, she begins to understand who Molly is and why they surprisingly share so much in common.","genres":"Comedy, Drama, Family","year":"2012","imdbId":"tt1978479"},
{"title":"Coyote Run","actors":"Michael Paré, Macha Grenon, Peter Greene, Michel Perron","director":"Shimon Dotan","synopsis":"A drink-soaked Vietnam veteran still bears the emotional scars of that terrible conflict. However, when a rogue mobster on the run with $15 million crosses his path, he sees his chance to catch the bad guy and exorcise a few Vietnam ghosts into the bargain.","genres":"Action, Adventure","year":"1996","imdbId":"tt0115960"},
{"title":"On the 2nd Day of Christmas","actors":"Mary Stuart Masterson, Mark Ruffalo, Lauren Pratt, David Hewlett","director":"James Frawley","synopsis":"Con-woman Trish and her niece\/ward Patsy are caught trying to steal from a department store right before Christmas. With the holidays so near, Bert, a store employee, agrees to be responsible for the pair so that Patsy need not spend the holidays in social services. Romance ensues.","genres":"Comedy, Drama, Family","year":"1997","imdbId":"tt0129359"},
{"title":"Two Faces of the Seventeenth Century","actors":"Philippe De Montebello, Paul Hecht","director":"John Musilli","synopsis":"Two paintings owned by The Metropolitan Museum of Art (New York City) are compared. They are called \"masterpieces\" by museum Director Philippe De Montebello. One: Rembrandt's self-portrait of 1660. Two: Velazquez' portrait of Juan De Pareja. This half hour contains two separate short films.","genres":"Documentary","year":"1979","imdbId":"tt1270699"},
{"title":"Bro","actors":"Harry Allen, Joe Duffy, Sherry Edwards, Daniel Garza","director":"Prasong Suphachadiwong","synopsis":"Bill (Josh Jacobson), a pizza delivery guy, is threatened by Henrick, his crazy landlord (Joe Duffy), to pay overdue rent by 8:00 P.M., or Bill and his brother George (Harry Allen) will be evicted. On his way to deliver a pizza, Bill stumbles upon a 'Happy Farting Contest' between stinky contestants cramped inside a skyscraper elevator! Bill neglects his pizza delivery, so that he can compete for the $20,000 prize, and use some of it to stop their imminent eviction. Does Bill have the most smelly and offensive farts to win, or will he lose both the contest, their apartment, and his job, too?","genres":"Short, Comedy, Drama","year":"2012","imdbId":"tt2337884"},
{"title":"Affection\/Affectation","actors":"Davis DeRock, Laurie Winkel, Aubry Peters, Luke Matheis","director":"Aubry Peters","synopsis":"Clint, Derek and Ben, three young bachelors who think they have life figured out. But when Clint is confronted by the return of the one who got away, he is forced to re-examine his lifestyle. Clint's quest for answers sends the household into tumult. Derek questions the solidarity of his relationship, beginning a quest to recapture his single days. Meanwhile, Ben struggles to find compromise between his desire and his gentlemanly ways. Can old flames be rekindled? Can you ever be sure you've found the right one? Do nice guys always finish last? They hope to find answers but the lines between love, lust and desperation may be more blurred than they ever believed.","genres":"Comedy, Drama, Romance","year":"2010","imdbId":"tt1806757"},
{"title":"The Hardys Ride High","actors":"Lewis Stone, Mickey Rooney, Cecilia Parker, Fay Holden","director":"George B. Seitz","synopsis":"Sixth of the Judge Hardy series. Judge James K. Hardy is brought the fabulous news from attorney George Irving, that he could be the heir to 2 million dollars. In order to claim the inheritance, he and his family must leave for Detroit. The disinherited heir Philip 'Phil' Westcott, adopted son of the deceased relative, has to leave the fabulous mansion Detroit. But the playboy Phil ain't going down without a fight. He decides on a charm offensive. First with Polly Benedict and foremost Andrew 'Andy' Hardy, the son of Judge Hardy. Various complications follow.","genres":"Comedy","year":"1939","imdbId":"tt0031403"},
{"title":"Threat","actors":"Carlos Puga, Keith Middleton, Rebekka Takamizu, Kamouflage","director":"Matt Pizzolo","synopsis":"THREAT revolves around a street riot in NYC's Lower East Side. At the center of the riot are two friends (a homeless straightedge punk named Jim and a hip hop revolutionary father named Fred) who inadvertently cause the riot when they bring their street tribes together and fail to avoid a conflict that quickly spirals out of control. As the characters struggle through the chaos, some seeking to stop the violence and others seeking to escalate it, they face their own demons and find their own forms of redemption and damnation.","genres":"Drama","year":"2006","imdbId":"tt0410757"},
{"title":"Killfilm II","actors":"Andrew Ainsworth, Yanet Candelario, John Foote, Jason Gosbee","director":"Andrew Ainsworth, J.A. Worthington","synopsis":"Film Instructor: Bernie MacNeil has designed a new HD Workshop within the Toronto Film School and is slowly luring brainwashed students into his trap. Video Production teacher: Andrew Ainsworth must put an end to this by any means necessary.","genres":"Short, Action, Comedy","year":"2007","imdbId":"tt3704870"},
{"title":"Kidnap Ronnie Biggs","actors":"Ronald Biggs","director":"Neil Rawles","synopsis":"Documentary telling the story of the mission to kidnap great train robber Ronnie Biggs from Rio and bring him back to England.","genres":"Documentary","year":"2006","imdbId":"tt0775497"},
{"title":"Gahiji","actors":"Jovan Adepo, Mickaëlle Bizet, Terrell Hamilton, Dwayne Stevenson","director":"Kevin Wells","synopsis":"A Hutu soldier struggles to be accepted within his militia troop during the Rwandan genocide.","genres":"Short","year":"2014","imdbId":"tt3451258"},
{"title":"Obsessed with Vertigo","actors":"Barbara Bel Geddes, Henry Bumstead, Herbert Coleman, C.O. Erickson","director":"Harrison Engle","synopsis":"A documentary about the making and restoration of Alfred Hitchcock's masterpiece \"Vertigo\". Narrated by Roddy McDowall, with behind-the-scenes talk from Barbara Bel Geddes, Henry Bumstead, Robert A. Harris, Patricia Hitchcock, James C. Katz, Kim Novak, Peggy Robertson and Martin Scorsese. Brings fresh perspective, not just to the film and the director, but to the Fifties Hollywood as well.","genres":"Documentary, Short","year":"1997","imdbId":"tt0192387"},
{"title":"Bro","actors":"Paul Hickert, Tyrone Paul Jr., Dashaun Jiwe Morris, Derek McLaurin","director":"Jared Crowelle","synopsis":"Bro is the story of Jamal and AJ, two brothers in NYC. Jamal returns home from prison to see a different world and a younger brother following in his footsteps. Their lives collide into a day they wont forget.","genres":"Short, Drama","year":"2014","imdbId":"tt3653762"},
{"title":"Legend of the Pearly Ivories","actors":"Vanessa Fioretti, David Grimes, John Reed Hryszkiewicz, Jonathon M.B. Hunter","director":"Katrina Bolletta","synopsis":"Left at the altar by the woman he loves, unemployed, deep in debt to the mob, arrested for a crime he didn't commit... it's safe to say Civil's life could be going better. Then he runs into Dixie, a woman of his past, and together they hatch a plan that will get him out of trouble with the mob, a new job, and possibly also back together with the woman of his dreams. The only thing he'll have to sacrifice is what he holds most dear.","genres":"Short, Comedy","year":"2008","imdbId":"tt1387204"},
{"title":"A Moment in Time","actors":"Walid Alzubidi, Jason Bray, Nadira Cholakh, Joval Eblin","director":"Andrew M. McGivern","synopsis":"After insurgents attack an Iraqi village, an Army sergeant is ordered to lead his squad of young soldiers into the combat zone for reinforcements.","genres":"Short, Drama, War","year":"2007","imdbId":"tt1362265"},
{"title":"Sara Get","actors":"Carrie Madsen, Anya Prinz","director":"Anthony Williamson","synopsis":"Woman and her surrogate renegotiate terms","genres":"Short, Drama","year":"2013","imdbId":"tt2937768"},
{"title":"The Peek-A-Boo Card","actors":"Paul Garafola, Melissa Glassman","director":"Melissa Glassman","synopsis":"Woman gives naughty card of herself to her unsuspecting beau.","genres":"Short, Comedy","year":"2011","imdbId":"tt2618862"},
{"title":"Basket Bronx","actors":"Pharaoh Anderson-McCray, Ana Bellinghausen, Paige Camisasca, Noel Galvez","director":"Martín Rosete","synopsis":"Alex is an African-American kid from the Bronx who dreams of playing basketball as his idols. However, the gang of older guys in the neighborhood keeps reminding him that he cannot. One day Kiat, a newly arrived Chinese girl, appears in his life and using some Zen philosophy teaches him to overcome his fears, to enjoy life as much as possible and to stop worrying about his results.","genres":"Short, Drama","year":"2009","imdbId":"tt1378192"},
{"title":"The Bay","actors":"Nansi Aluka, Christopher Denham, Stephen Kunken, Frank Deal","director":"Barry Levinson","synopsis":"This \"found-footage\" film is set in 2009 in the town of Claridge, Maryland on the Chesapeake Bay. During the town's annual 4th of July Crab Festival, townspeople become sick, exhibiting a variety of symptoms, which leads local news reporters to suspect something has infected the water there. No one is sure what it is or how it's transmitted, but as people start to behave strangely, and others turning up dead, fear spawns into panic. The town is shut down as government authorities confiscate video footage from every media or personal source they find, in an effort to cover-up the incident. But one local reporter who witnessed the epidemic, was able to document, assemble, and hide this film in hopes that one day, the horrible truth would be revealed . . .","genres":"Horror, Sci-Fi, Thriller","year":"2012","imdbId":"tt1713476"},
{"title":"AKP: Job 27","actors":"Tyce Francois, Roxanne Prentice, Kelly Fedonni, Curt Wu","director":"Michael L. Suan","synopsis":"A Yakuza hitman travels to North America for his 27th job, only to find lingering memories of lost love through a chance encounter with a beautiful prostitute.","genres":"Action, Crime, Drama","year":"2013","imdbId":"tt2215926"},
{"title":"Road to Rio","actors":"Bing Crosby, Bob Hope, Dorothy Lamour, Gale Sondergaard","director":"Norman Z. McLeod","synopsis":"Scat Sweeney, and Hot Lips Barton, two out of work musicians, stow away on board a Rio bound ship, after accidentally setting fire to the big top of a circus. They then get mixed up with a potential suicide Lucia, who first thanks them, then unexpectedly turns them over to the ship's captain. When they find out that she has been hypnotized, to go through a marriage of convenience, when the ship reaches Rio, the boys turn up at the ceremony, in order to stop the wedding, and to help catch the crooks.","genres":"Adventure, Comedy, Musical","year":"1947","imdbId":"tt0039776"},
{"title":"Play On","actors":"Chase Ashurst, Joe Backer, Ari Bavel, Marlon Byers","director":"David Story","synopsis":"To young Scotsman Keir Kilgour, the pursuit of rugby stardom is a defiant yet deferential quest for the love and respect of his legendary, old school father. When the crushing expectations of father, fans and self produce a spectacular flame out in a big match, Keir flees his rugby background in a delusional quest for redemption on the bigger stage of professional football (gridiron). When the bubble of his rash, ill planned \"big money\" professional aspirations bursts, Keir - demoralized, broke but too proud to return home - stumbles upon an unlikely savior, the Kansas City Wanderers, a failing second division rugby club, a motley collection of weekend warriors and the ultimate in amateur. After jarring and comic doses of humility, Keir discovers the true currency of the game, the teammates that regardless of skill and aspiration come back for more each and every weekend. As the Wanderers feed off Keir's renewed approach, they propel him homeward to face the music... and his father in one final attempt to gain the love and respect that eluded him since childhood.","genres":"Drama, Sport","year":"2010","imdbId":"tt1345506"},
{"title":"Harvest Jazz & Blues Festival 2012","actors":"The Avett Brothers, Sharon Jones, Derek Trucks","director":"John Pollack","synopsis":"For six days every September, Fredericton, New Brunswick is as vibrant as any major Canadian city. Streets are closed and tents are raised, as the city's quaint downtown is transformed into...","genres":"Documentary, Short, Music","year":"2013","imdbId":"tt3003742"},
{"title":"Shake, Rattle and Rock!","actors":"Renée Zellweger, Howie Mandel, Patricia Childress, Max Perlich","director":"Allan Arkush","synopsis":"Two young girls start a band and open up a nightclub in town where the local kids can hang out and stay out of trouble, but they encounter opposition from local people who think rock is the devil's music and will corrupt their kids.","genres":"Drama, Music","year":"1994","imdbId":"tt0111147"},
{"title":"Between Bedford","actors":"Lenay Dunn, Callie Harlan, Jason Dunn, Aubrey Sinn","director":"Lenay Dunn","synopsis":"Sidney & Jax Bedford are Twin Sisters who live in small town Tennessee. Daughters of world renown musicians. Music Royalty. Seems perfect, but every family has it's secrets. Music brings the girls together. It's pretty much the only thing they've ever agreed on since they were young. But Sidney does not want the attention & fame that comes along with being an artist (meanwhile all Jax craves is attention), so their songs have never left their living room. Until now. Sidney is swept up into a whirlwind of fame and adventure brought on by her sister Jax entering a magazine contest to open up for her celeb crush - the biggest pop star in the world - 'Jace Walker'; dragging them both into a wild world filled with love triangles, sibling rivalry, lies & music.","genres":"Drama","year":"2014","imdbId":"tt3914012"},
{"title":"In the Land of Women","actors":"Elena Anaya, Adam Brody, Kelsey Keel, Danielle Savre","director":"Jon Kasdan","synopsis":"L.A. soft-porn writer Carter Webb is frustrated enough after his actress girlfriend dumps him to need a serious break. He decides to spend it with his grandmother, who can't really take care of herself and her Detroit suburb house anyway. Helpful Carter soon overcomes mishaps to bond with her foxy neighbor across the street and her brat daughter. Helping them actually helps him regain perspective and self-confidence.","genres":"Comedy, Drama, Romance","year":"2007","imdbId":"tt0419843"},
{"title":"Father's Day","actors":"David James Elliott, Catherine Bell, John M. Jackson, Patrick Labyorteaux","director":"Tony Wharmby","synopsis":"During war games at Quantico a Marine corporal, driving a tank, becomes disoriented and accidentally demolishes his unit commander's tent; he then faces a court-martial for dereliction of duty. His personal life, which includes a drug-user estranged wife with sole custody of a one-year-old son, has diluted his attention and marred his performance. Harm, Mac, Bud, and Dalton all work to defend the corporal and to represent him in the custody proceeding. Harm gets a change of venue to Parris Island; however, en route there, the defendant escapes, returns to Quantico, seizes a tank, takes his son for a ride, and precipitates a confrontation. Harm brings in Grandma Bea to join the defense team, and she helps immeasurably. The story ends after the custody hearing but before the court-martial.","genres":"Action, Crime, Drama","year":"1998","imdbId":"tt0613258"},
{"title":"Faggot","actors":"Tameka Bob, Chassie James, Togba Norris, Theodore Jones","director":"Kenneth Brown, Miguel David Cala","synopsis":"Faggot is a story that defines the meaning of true friendship \"no matter what\". This film aims to test the possibilities of a friendship between straight and gay African American men, while exploring the homophobic title attached to the black community.","genres":"Short, Drama","year":"2012","imdbId":"tt2479454"},
{"title":"Beautiful Hair","actors":"Garbriel Ibarra, Dervla Toal","director":"Assaf Hayut","synopsis":"Eleen is a social worker who struggles to maintain clear boundaries between herself and her patients. We join her following an emotional encounter that paves her way through the day.","genres":"Short, Drama","year":"2011","imdbId":"tt1954265"},
{"title":"13\/13\/13","actors":"Trae Ireland, Erin Coker, Jody Barton, J. Scott","director":"James Cullen Bressack","synopsis":"For millennia, calendars have added an extra day every four years. In doing so, they violated the ancient Mayan calendar. Now we are in the 13th month of the 13th year of the new millennium, and the few who survive will battle a world of demons.","genres":"Horror","year":"2013","imdbId":"tt2991516"},
{"title":"Deadbeats","actors":"Robert Baker, G.J. Echternkamp, Will Greenberg, Russell Jones","director":"Adrian Cruz","synopsis":"The end of the world. The dead walk the earth. One hapless wanderer, oblivious to the worlds recent events, finds salvation from the zombie infested world amongst four callous slackers in a small apartment.","genres":"Short, Action, Comedy","year":"2004","imdbId":"tt2263464"},
{"title":"The Night of the Strangler","actors":"Micky Dolenz, James Ralston, Michael Anthony, Chuck Patterson","director":"Joy N. Houck Jr.","synopsis":"In New Orleans, a man learns that his sister has a black lover and is pregnant. He throws her away and, a bit later, she is murdered by a mysterious killer with a peace-sign belt buckle, who disguises the murder as suicide. Her friend Vince and a black priest investigates, but this leads to more murders until a surprise ending...","genres":"Drama","year":"1972","imdbId":"tt0069006"},
{"title":"Izzy & Moe","actors":"Jackie Gleason, Art Carney, Cynthia Harris, Zohra Lampert","director":"Jackie Cooper","synopsis":"This is the film based on the true adventures of Izzy and Moe. They were two retired vaudeville performers who, being unemployed, decide to become prohibition enforcement agents. They are initially treated with scorn from fellow agents as old men pretending to be cops. That abuse soon stops when the pair refuse to use the standard but futile methods of the agency and instead employ their theatrical experience to use an amazing variety of disguises and tricks to become two of the most effective agents in the force. Eventually, their outstanding string of successful raids and arrests starts drawing the attention of the mob and their bought cops, who desperately plan to stop this pair.","genres":"Comedy, Crime","year":"1985","imdbId":"tt0089358"},
{"title":"Case Study","actors":"Rex Manaster, Rebecca Beazley, Natalie Jones, Shannon Laine","director":"Tony Quinn","synopsis":"Case Study explores people's views and opinions of the realities of our relationships, such as race relations, disease and illness, hetero- and homo-sexual relationships, loneliness, dating, sex, marriage, etc. While Case Study provides an abundance of laughs, it is also wrought with emotional twists. Insightful and educational, Case Study allows its audience to be the proverbial \"fly on the wall\" peering into the character's real lives. Viewers also hear directly from the characters as they respond in camera to probing interview questions concerning their own personal relationships. Every audience member views Case Study with a true sense of, \"I can relate!\"","genres":"Comedy","year":"2007","imdbId":"tt0992907"},
{"title":"Mad Dog and the Flyboy","actors":"Joey Luthman, Christopher Wiehl, Israel Broussard, Mia Rose Frampton","director":"Christopher Rausch","synopsis":"Billy Thompson thought it was just another day in Jr High, but when a comic book transports him into a World War 2 bomber mission he must find the courage within himself if he's to save the day and get the girl.","genres":"Short, Action, Adventure","year":"2010","imdbId":"tt1743947"},
{"title":"Distant Lover: TTYL","actors":"Amber P. Gray, Jason Hurt, Brittany Leaphart, Bisserat Tseggai","director":"Quan Lateef","synopsis":"An artistic Short Film that centers around two couples in long distance relationships as they interact during their last moments together for a while.","genres":"Short, Romance","year":"2014","imdbId":"tt3540078"},
{"title":"On the Low","actors":"Deondray Gossett, Delpaneaux Wills, Thomas Mikal Ford, Antoine D'Angelo Lattier","director":"Luther M. Mace","synopsis":"\"On The Low,\" a short film, explores the emotional consequences of a hush-hush intimate relationship between two African-American high school boys. It tells the story of a young man, Ty Evans, coming to terms with his sexuality and the inner conflict he experiences. The true extent of Ty's relationship with his classmate, Kevin Banks, begins to trouble him when the boys get into a schoolyard shoving match. As the tension between them escalates, Ty realizes what began as innocent curiosity and experimentation has blossomed into something deeper.","genres":"Drama, Short","year":"2005","imdbId":"tt0458446"},
{"title":"Overcoming Differences","actors":"Rochelle Rissland, Naomi Yamada","director":"Sarah Kakusho","synopsis":"There is no difference that cannot be overcome.","genres":"Short, Family","year":"2010","imdbId":"tt1693828"},
{"title":"Father-Like Son","actors":"Mac Alsfeld, Andrew Megison, Molly Conarro, Grayson Ward","director":"Mac Alsfeld","synopsis":"A young college graduate struggling to cope with a father his own age treads against the waters of his own pessimistic views on love and marriage in order to reconcile his relationship with his mother and ensure the well-being of his family.","genres":"Comedy, Drama, Romance","year":"2014","imdbId":"tt2451750"},
{"title":"Shabazz the Disciple: Passion of the Hood Christ, Vol. 1","actors":"R.H. Bless, Shabazz the Disciple, Pump, Ready Roc","director":"Shabazz the Disciple, Matthew C. Dumond","synopsis":"A real life walk through Brooklyn's infamous Red Hook Houses, home of Hip Hop artist Shabazz the Disciple.","genres":"Documentary, Music","year":"2006","imdbId":"tt1688201"},
{"title":"Give 'em Hell, Harry!","actors":"James Whitmore","director":"Steve Binder","synopsis":"One man show about the presidency of Harry S Truman.","genres":"Biography, Comedy, Drama","year":"1975","imdbId":"tt0073053"},
{"title":"Talk Radio","actors":"Eric Bogosian, Ellen Greene, Leslie Hope, John C. McGinley","director":"Oliver Stone","synopsis":"An acerbic radio talk show host based in Dallas starts what could be an important few days when he discovers that his controversial late night show is about to be \"picked up\" by a nationwide network of radio stations. However, all is not perfect for him, because on top of troubles with his love life and fears that the management of the network will try to alter the content of his show he has to cope with a neo-nazi group who have been angered by his forthright opinions.","genres":"Drama","year":"1988","imdbId":"tt0096219"},
{"title":"A Moment in Time","actors":"Seth Gandrud, Caelia Adams, London Tobin, Payton Burns","director":"Caelia Adams","synopsis":"A 19th century writer is haunted by his wife in dreams and remembers their time together when they were children.","genres":"Short, Romance","year":"2012","imdbId":"tt2690550"},
{"title":"Sexual Violence and the Triumph of Justice","actors":"Lisa Biersay","director":"Rob Barsony","synopsis":"The documentary depicts the International Criminal Tribunal for the Former Yugoslavia's historic role in the prosecution and adjudication of wartime sexual violence. The documentary includes interviews with former and current senior staff members of the ICTY, as well as testimonies from witnesses and survivors of sexual violence, who bravely gave evidence at trials.","genres":"Documentary, Short","year":"2012","imdbId":"tt2317454"},
{"title":"Non-Abductees Anonymous","actors":"Doc Clay, Carmen Dubnik, Chad Edwards, Sarah Kelly","director":"Philip Powell","synopsis":"Wearing a simple name tag, Ted looks into the camera and tells us about his forming the group Non-Abductees Anonymous, for people who realize that aliens will probably never abduct them. We see a group at a meeting, talking about their embarrassment at work when yet another colleague reports being abducted. It's all about self-esteem, as these people tell their stories and offer each other support. Allen tries to convince the group that he has actually been abducted, but his story doesn't hold up to their questions. He gets a hug. They soldier on, in fact, they party on, finding reassurance in each other's friendship.","genres":"Comedy, Short","year":"2001","imdbId":"tt0400692"},
{"title":"A Lutefisk Western","actors":"Cody Bushee, Rachel Palashewski, Bill Dablow, Jim Alger","director":"Eric Carlson","synopsis":"A story of greed, violence, and maple syrup set in the serene backdrop of the Upper Midwest.","genres":"Short, Action, Comedy","year":"2010","imdbId":"tt1692243"},
{"title":"Lonely Hearts Club","actors":"India Menuez","director":"Asli Baykal","synopsis":"Lonely Hearts Club: a satirical take on a traditional self-help group, exploring their own hilariously odd hang-ups.","genres":"Short, Comedy, Drama","year":"2014","imdbId":"tt3836618"},
{"title":"What Love Sees","actors":"Richard Thomas, Annabeth Gish, August Schellenberg, Kathleen Noone","director":"Michael Switzer","synopsis":"Based on a true story, spanning fifteen years during the turmoil of the Second World War, this is an incredible and inspiring saga of two young people whose very special relationship helps ...","genres":"Drama","year":"1996","imdbId":"tt0118142"},
{"title":"West Virginia Slims","actors":"Travis Maiuro, Olivia Stewart","director":"Travis Maiuro","synopsis":"In this out of ordinary love story, an eccentric-romantic youth waits for the French love he has longed for.","genres":"Short, Romance","year":"2010","imdbId":"tt1663229"},
{"title":"The Children","actors":"Peter Dinklage, Nikolaj Coster-Waldau, Lena Headey, Emilia Clarke","director":"Alex Graves","synopsis":"Jon Snow arrives at Mance's camp and both of them come up with suggested peaceful solutions to the conflict. However Stannis turns up with a vast army which defeats the Wildlings. Jon acknowledges him but requests fair play for Mance who treated him well when he was his prisoner. At King's Landing Cersei is threatening to go public about herself and Jaime if Tywin insists on marrying her to Loras but they are overtaken by events when Tyrian escapes, helped by Jaime and Lord Varys, and kills Tywin and the faithless Shae whom he finds in his father's bed. Hidden in a large crate he is lifted aboard a ship to leave King's Landing with Varys. Daenerys is seeing supplicants, one of whom presents her with the corpse of his child, killed by her escaped dragon Drogon. Aware that her dragons are now a menace she locks up the other two. Bran and his friends reach the tree and the three-eyed raven but are attacked by Wights, who kill Jojen. The remaining party is led to safety in a cave by a mystical little girl who claims she is one of an ancient race the Children. Brienne catches up with Arya and the Hound and mortally wounds the latter in a sword fight. Rather than give in to his pleas to kill him quickly Arya leaves him to die and heads to a seaport where she hands a ship's captain the iron coin given her by Jaqen and, after uttering 'Valar Morghulis' is given passage.","genres":"Adventure, Drama, Fantasy","year":"2014","imdbId":"tt3060860"},
{"title":"Dave's Dead","actors":"Luke Ryan, Patrick Brammall, Charlotte Gregg, Stefan Dennis","director":"Alethea Jones","synopsis":"Dave's dead. So why can't Tom accept it? Dave may have been his best mate, but this isn't any way to behave. Not when you're giving the eulogy. Then again, maybe Dave wasn't such a great mate after all... That's what Tom is beginning to suspect. This won't be your typical funeral.","genres":"Short, Comedy","year":"2012","imdbId":"tt2345515"},
{"title":"Case File: The Smell of Lorne","actors":"Richard C. Jones, Michelle Keffer, Megan Minto, Ray Rosales","director":"Anthony Bromberg","synopsis":"'Case File: The Smell of Lorne' focuses on two thirty-ish people, Lorne and Lorna, trying to figure out how they're supposed to overcome their fears and accept their love-ability. We follow our heroes from their meeting at a dry cleaners through their first dates colored by Lorne's obsession with smelling good and finally to the stinky house fire that threatens to ruin their one-month anniversary and possibly the whole relationship. The film is driven by superb characters (acted to perfection) who bust our guts and pluck our heart strings in alternate frames with their brutally real insecurities and whimsicalities.","genres":"Short, Comedy, Drama","year":"2010","imdbId":"tt1730193"},
{"title":"The Bride and the Beast","actors":"Charlotte Austin, Lance Fuller, Johnny Roth, William Justine","director":"Adrian Weiss","synopsis":"When Laura and Dan get married, she's more interested in Dan's gorilla. It's revealed through hypnosis that she was Queen of the Gorillas in a previous incarnation.","genres":"Horror","year":"1958","imdbId":"tt0051434"},
{"title":"Sophia Returning","actors":"John Lamb Lash","director":"Jay Weidner","synopsis":"John Lamb Lash, comparative mythologist and author of the classic book, Not In His Image, offers an examination of the truths hidden deep within the ancient Gnostic sects of Europe. Two thousand years ago the Pagan religion of Gnosticism was one of the world's largest religious belief systems. The Gnostics held a deep reverence for the earth in all its wonder and beauty. In contrast to the teachings of the patriarchal and monotheistic religious traditions, the Gnostic creation mythos was centered upon the compelling story of the Wisdom Goddess Sophia. This knowledge, which offers us new insight into the power of the earth as a vital living being, has been brought forth today as a fundamental part of the Gaia theory. The Gnostics had many beliefs that were considered heretical by the emerging Christian populations of classical Europe. John Lamb Lash acquaints us with their unique perspective on the nature of human experience and the destructive power of the mysterious beings they called the Archons whose dark influence has led to the fear-based, chaotic character of the times in which we live. By assisting us in comprehending the Gnostics vast knowledge of nature, the Earth, and the intimate relationship between the Goddess Sophia, and we who are her creation, he reconnects us with our ancient heritage and offers a sacred path toward the future.","genres":"Documentary","year":"2009","imdbId":"tt2005348"},
{"title":"Emmy","actors":"Tia Robinson, Christine Corpuz, Ochuwa Oghie","director":"Robert Abilez","synopsis":"Sometimes the hardest thing to face is yourself. Emmy, a young, hip, and confident, New Yorker, meets up with some friends for a girls' night out. On her way home, she drunk-dials her ex-boyfriend and is forced to confront her true feelings about their relationship, and herself.","genres":"Short, Comedy, Drama","year":"2013","imdbId":"tt3455402"},
{"title":"IDPA California State Championship: 5 Dogs Range, Bakersfield, CA","actors":"Gretchen Martin","director":"Chris Ward","synopsis":"American Trigger Sports Network (ATSN.TV) Trigger Sports LIVE! captures the action at the IDPA (International Defense Pistol Association) California State Championship. Watch the best IDPA pistol shooters at 5-Dogs Range in Bakersfield, CA. The event, held on October 9, 2010, hosted about 100 shooters. This exciting IDPA (International Defense Pistol Association) competition features a variety of stages, targets, shooting styles and pistols, plus SWAT member, top shooter and trainer interviews with ATSN.tv's Gretchen Martin. Congratulations to CDP Champion Robert Hostetter, ESP Champion Brett Nelson, SSP Champion Bradley Holt, ERS Champion Robert Sharp, SSR Champion Matt McCourt, High Lady Kenna Sams and High Junior Nathan Higdon plus \"Most Accurate\" John Hall. Thanks to all the shooters that participated in the event and in the making this DVD. As seen on ATSN's Trigger Sports LIVE! hosted by James B. Towle.","genres":"Short, Sport","year":"2010","imdbId":"tt2965334"},
{"title":"Ocean Buzz","actors":"Caylen Clark, Chris Lerude, Marcia Walter, Steve Sturla","director":"Sean Delgado","synopsis":"OCEANBUZZ is a 'Hitchcockian' mystery\/thriller about two women who are strangers, coming to terms with the voids in their lives through a shared death on the beach.","genres":"Thriller","year":"2003","imdbId":"tt0390317"},
{"title":"Wayside Rest","actors":"Catherine Johnson Justice, Billy Mullaney","director":"James Byrne","synopsis":"In this comedic odd-couple encounter, a middle age bar band singer on the run, meets a high school loner with illusions of grandeur. Confusion reins and sparks fly.","genres":"Short, Comedy, Drama","year":"2013","imdbId":"tt3043694"},
{"title":"Save the Cat","actors":"Maggie Geha, Grant Rosenmeyer, Jason Liles, Julie Hays","director":"Harry Tarre","synopsis":"A day gone wrong for an intern stuck in an office where everyone gives all of their attention and love to a fat, unimpressive office cat, Gloria.","genres":"Short, Comedy","year":"2012","imdbId":"tt2368306"},
{"title":"No Ordinary Jo","actors":"Ashley Bracken, Nathan Ferrier, Steven Guistolise, Christopher M. Lundy","director":"Jamison P. Derfler","synopsis":"Joseph, a comic book fan-boy, is visited one night by a super-natural being who tells Joseph that he possess a superpower. However, what that superpower is, is not revealed to him. Along ...","genres":"Short, Adventure, Comedy","year":"2013","imdbId":"tt2501340"},
{"title":"Best Friends","actors":"Kathryn Morris, Danny Pino, John Finn, Jeremy Ratchford","director":"Mark Pellington","synopsis":"An old truck is found in a river with human remains inside, leading the team to re-open the case of a girl who disappeared in 1932. When the girl's former best friend is interviewed, questions arise: just best friends, or forbidden love?","genres":"Crime, Drama, Mystery","year":"2005","imdbId":"tt0543911"},
{"title":"Catty Cornered","actors":"Mel Blanc","director":"Friz Freleng","synopsis":"Rocky the gangster kidnaps Tweety Bird for a million dollar ransom and holes up in an abandoned city building. Sylvester Cat in an alley below hears Tweety's sad cries and decides to rescue him - for his lunch.","genres":"Crime, Family, Animation","year":"1953","imdbId":"tt0045612"},
{"title":"The Wild Blue Yonder","actors":"Brad Dourif, Donald Williams, Ellen Baker, Franklin Chang-Diaz","director":"Werner Herzog","synopsis":"An alien narrates the story of his dying planet, his and his people's visits to Earth and Earth's man-made demise, while human astronauts attempt to find an alternate planet for surviving humans to live on.","genres":"Sci-Fi","year":"2005","imdbId":"tt0443693"},
{"title":"Lucy's Heart","actors":"Kate Avery","director":"Dan Andrew","synopsis":"Lucy was always a dreamer. She dreamed of fame, fortune and marrying the man of her dreams. But you know what they say, the bigger the dream, the harder the fall.","genres":"Short, Comedy","year":"2006","imdbId":"tt1805313"},
{"title":"After Tomorrow","actors":"Reyna de Courcy, Jason Griffith, Elisabeth Ness, Mariette Strauss","director":"Jill Campbell","synopsis":"On the eve of graduation a senior pranks the commencement speaker earning her a degree in reality. 'After Tomorrow' was produced as part of Stony Brook Southampton\/Killer Films inaugural 20\/20\/20 program. At Southampton College it's tradition to play a practical joke on the commencement speaker the night before graduation. Zoe volunteers to seduce prolific writer and commencement speaker Shane Miller by luring him to the school windmill where fellow students will film the 'action.' Things don't turn out as planned when Zoe finds herself falling for her victim. Shane's severe reaction to being pranked shakes Zoe out of her millennial existence causing her to confront what her life will be like 'After Tomorrow.'","genres":"Short, Drama","year":"2013","imdbId":"tt3210754"},
{"title":"Pure Cinema: Through the Eyes of the Master","actors":"Joe Carnahan, John Carpenter, Guillermo del Toro, William Friedkin","director":"Gary Leva","synopsis":"Alfred Hitchcock often referred to his style of film making as \"pure cinema\" - using camera movement, editing, music and sound to tell stories that would be impossible in any other medium. Even as early as the 1920s, while his contemporaries were simply filming stage plays, Hitchcock was creating a cinematic language that has endured and influenced every filmmaker who came after him. This in-depth documentary allows directors such as William Friedkin, Martin Scorsese and Guillermo del Toro to examine the power and mastery of Hitchcock's cinematic style, breaking down such signature sequences as the bell tower scene in Vertigo, the attic attack in The Birds and the shower scene in Psycho.","genres":"Documentary","year":"2008","imdbId":"tt1301278"},
{"title":"Rosie Live","actors":"Clay Aiken, Anti-Gravity, Alec Baldwin, Tom Berklund","director":"Richard Jay-Alexander","synopsis":"Rosie O'Donnell hosts an hour-long live variety special in the tradition of such series as \"The Carol Burnett Show\" and \"The Ed Sullivan Show,\" featuring celebrity guests, musical acts, comedy skits and giveaways for members of her in-studio audience as well as selected home viewers.","genres":"Comedy, Music","year":"2008","imdbId":"tt1324891"},
{"title":"The Killer Eye","actors":"Jacqueline Lovell, Jonathan Norman, Nanette Bianchi, Costas Koromilas","director":"David DeCoteau","synopsis":"An ophthamologist is trying to develop a technique for seeing into another dimension. After a previous experiment went terribly wrong, blinding his test subject he makes some revisions to his methodology. Unfortunately, his latest experiment is a horrible success. His newest test subject peers into another dimension and is killed by an extra-dimensional entity which enters our world and infests the eye of the subject. After expanding to enormous size and detaching from the body of its victim, the eye goes on a rampage.","genres":"Comedy, Horror, Sci-Fi","year":"1999","imdbId":"tt0177886"},
{"title":"A Taste of His Own Medicine","actors":"Herbert Prior, Mabel Trunnelle, Ben F. Wilson, Harry Gripp","director":"Charles M. Seay","synopsis":"The seed of jealousy is sown in Jones when two gentlemen, unknown to him, bow to his wife. His unfounded jealousy is intensified when, a few days later, Mrs. Jones' sister sends her a present for Mr. Jones, which arrives while the Joneses are at breakfast, with instructions not to show it to him until his birthday. Mr. Jones' angry expostulations to see the package avail him nothing, and he leaves for the office in a \"white heat,\" where he writes his wife a letter in a disguised handwriting, purporting to be from a former admirer, and begging for a clandestine interview. Mr. Jones' jealousy is further inflamed when the florist sends a bouquet of flowers to his office instead of to his home address, as given by Mrs. Jones. When Mrs. Jones receives the forged letter, she takes it immediately to the police station and a number of \"coppers\" are sent to watch for the admirer. Seeing nobody around but Mr. Jones, who had come to surprise his wife in the act of infidelity, the policemen arrest him and he is brought to the station house, where matters are finally straightened out.","genres":"Short, Comedy","year":"1913","imdbId":"tt0463219"},
{"title":"Midnight Sky","actors":"Maggie Kim, Michelle Glick, Amy Chang, Tana Sarntinoranont","director":"Tana Sarntinoranont","synopsis":"An anonymous space fighter pilot recounts two stories; his first date with a loved one on earth, and the face-to-face encounter with the alien enemy.","genres":"Short, Action, Romance","year":"2010","imdbId":"tt1617132"},
{"title":"Naked Under Leather","actors":"Jeff Beck, Mike Chapman, Arlene Quatro, Patti Quatro","director":"Victory Tischler-Blue","synopsis":"Naked Under Leather is a documentary film about the life and career of glam rocker Suzi Quatro.","genres":"Documentary, Music, Drama","year":"2004","imdbId":"tt0404267"},
{"title":"Garfield in Paradise","actors":"Lorenzo Music, Thom Huge, Wolfman Jack, Frank Nelson","director":"Phil Roman","synopsis":"Garfield, Jon, and Odie are in Hawaii and must save a native tribe from a erupting volcano with the help of their rented 1957 Chevy. Not that isn't time for Garfield to have a little love interest.","genres":"Animation, Short, Comedy","year":"1986","imdbId":"tt0166204"},
{"title":"One on One","actors":"Robby Benson, Annette O'Toole, G.D. Spradlin, Gail Strickland","director":"Lamont Johnson","synopsis":"Henry Steele is a basketball phenom at his small town high school, but when he matriculates to a big city university on a scholarship, soon realizes that he has few skills outside the sport...","genres":"Drama, Sport","year":"1977","imdbId":"tt0076500"},
{"title":"The Tree of Life","actors":"Brad Pitt, Sean Penn, Jessica Chastain, Hunter McCracken","director":"Terrence Malick","synopsis":"The impressionistic story of a Texas family in the 1950s. The film follows the life journey of the eldest son, Jack, through the innocence of childhood to his disillusioned adult years as he tries to reconcile a complicated relationship with his father (Brad Pitt). Jack (played as an adult by Sean Penn) finds himself a lost soul in the modern world, seeking answers to the origins and meaning of life while questioning the existence of faith.","genres":"Drama, Fantasy","year":"2011","imdbId":"tt0478304"}
]